EX15: PROC OPTIONS ( MAIN );                                                  DCL A DECIMAL FIXED;                                                          DCL B DECIMAL FIXED;                                                          DCL C DECIMAL FIXED NIT ( 4 );                                                 DCL D DECIMAL FIXED;                                                          DCL L LABEL;                                                                    A = 2;                                                                         GO TO L2;                 L1:                                                                             D = A + B;                 L=L3;                                                                          GO TO L;                  L2:                                                                              B = 3;                     L=L1;                                                                          GO TO L;                  L3:                                                                             D = D - C;                                                                    END EX15;                                                                     
